# Работа со словарями:
# Создайте переменную my_dict и присвойте ей словарь из нескольких пар ключ-значение.
# Например: Имя(str)-Год рождения(int).
# Выведите на экран словарь my_dict.
# Выведите на экран одно значение по существующему ключу, одно по отсутствующему из словаря my_dict без ошибки.
# Добавьте ещё две произвольные пары того же формата в словарь my_dict.
# Удалите одну из пар в словаре по существующему ключу из словаря my_dict
# и выведите значение из этой пары на экран.
# Выведите на экран словарь my_dict.

# Работа с множествами:
# Создайте переменную my_set и присвойте ей множество,
# состоящее из разных типов данных с повторяющимися значениями.
# Выведите на экран множество my_set (должны отобразиться только уникальные значения).
# Добавьте 2 произвольных элемента в множество my_set, которых ещё нет.
# Удалите один любой элемент из множества my_set.
# Выведите на экран измененное множество my_set.

# Пример результата выполнения программы:
# Dict: {'Vasya': 1975, 'Egor': 1999, 'Masha': 2002}
# Existing value: 2002
# Not existing value: None
# Deleted value: 1999
# Modified dictionary: {'Vasya': 1975, 'Kamila': 1981, 'Artem': 1915, 'Masha': 2002}
# Set: {1, 'Яблоко', 42.314}
# Modified set: {'Яблоко', 42.314, 13, (5, 6, 1.6)}

my_dict = {'Вася': 1975, 'Аня': 1981, 'Дима': 1995, 'Маша': 2002}
print('Dictionary:', my_dict)
print('Year of birth Аня (Existing value): ', my_dict.get('Аня'))
print('Year of birth Маня (Not existing value): ', my_dict.get('Маня'))

my_dict.update({'Таня': '2002', 'Юра': '1998'})
print('Dictionary updated:', my_dict)
print('Deleted value:', my_dict.pop('Вася'))
print('Modified dictionary:', my_dict)

print('----------')

my_set = {1, 'Яблоко', 42.314, 1, 1, 'Яблоко', 42.314}
print('Set:', my_set)
my_set.update({45, 68, ('Ананас', 'Тыква')})
print('Modified set:', my_set)
